from __future__ import unicode_literals

import regex as re
import nltk

nltk.download("book")
from hazm import *
from keras.preprocessing.text import Tokenizer
from keras.preprocessing.sequence import pad_sequences
from sklearn.preprocessing import LabelEncoder

stopping_words = ["در", "به", "از", "كه", "مي", "اين", "است", "را", "با", "هاي", "براي", "آن", "يك", "شود", "شده",
                  "خود", "ها", "كرد", "شد", "اي", "تا", "كند", "بر", "بود", "گفت", "نيز", "وي", "هم", "كنند", "دارد",
                  "ما", "كرده", "يا", "اما", "بايد", "دو", "اند", "هر", "خواهد", "او", "مورد", "آنها", "باشد", "ديگر",
                  "مردم", "نمي", "بين", "پيش", "پس", "اگر", "همه", "صورت", "يكي", "هستند", "بي", "من", "دهد", "هزار",
                  "نيست", "استفاده", "داد", "داشته", "راه", "داشت", "چه", "همچنين", "كردند", "داده", "بوده", "دارند",
                  "همين", "ميليون", "سوي", "شوند", "بيشتر", "بسيار", "روي", "گرفته", "هايي", "تواند", "اول", "نام",
                  "هيچ", "چند", "جديد", "بيش", "شدن", "كردن", "كنيم", "نشان", "حتي", "اينكه", "ولی", "توسط", "چنين",
                  "برخي", "نه", "ديروز", "دوم", "درباره", "بعد", "مختلف", "گيرد", "شما", "گفته", "آنان", "بار", "طور",
                  "گرفت", "دهند", "گذاري", "بسياري", "طي", "بودند", "ميليارد", "بدون", "تمام", "كل", "تر 	براساس",
                  "شدند", "ترين", "امروز", "باشند", "ندارد", "چون", "قابل", "گويد", "ديگري", "همان", "خواهند", "قبل",
                  "آمده", "اكنون", "تحت", "طريق", "گيري", "جاي", "هنوز", "چرا", "البته", "كنيد", "سازي", "سوم", "كنم",
                  "بلكه", "زير", "توانند", "ضمن", "فقط", "بودن", "حق", "آيد", "وقتي", "اش", "يابد", "نخستين", "مقابل",
                  "خدمات", "امسال", "تاكنون", "مانند", "تازه", "آورد", "فكر", "آنچه", "نخست", "نشده", "شايد", "چهار",
                  "جريان", "پنج", "ساخته", "زيرا", "نزديك", "برداري", "كسي", "ريزي", "رفت", "گردد", "مثل", "آمد", "ام",
                  "بهترين", "دانست", "كمتر", "دادن", "تمامي", "جلوگيري", "بيشتري", "ايم", "ناشي", "چيزي", "آنكه",
                  "بالا", "بنابراين", "ايشان", "بعضي", "دادند", "داشتند", "برخوردار", "نخواهد", "هنگام", "نبايد", "غير",
                  "نبود", "ديده", "وگو", "داريم", "چگونه", "بندي", "خواست", "فوق", "ده", "نوعي", "هستيم", "ديگران",
                  "همچنان", "سراسر", "ندارند", "گروهي", "سعي", "روزهاي", "آنجا", "يكديگر", "كردم", "بيست", "بروز",
                  "سپس", "رفته", "آورده", "نمايد", "باشيم", "گويند", "زياد", "خويش", "همواره", "گذاشته",
                  "شش 	نداشته", "شناسي", "خواهيم", "آباد", "داشتن", "نظير", "همچون", "باره", "نكرده", "شان", "سابق",
                  "هفت", "دانند", "جايي", "بی", "جز", "زیرِ", "رویِ", "سریِ", "تویِ", "جلویِ", "پیشِ", "عقبِ", "بالایِ",
                  "خارجِ", "وسطِ", "بیرونِ", "سویِ", "کنارِ", "پاعینِ", "نزدِ", "نزدیکِ", "دنبالِ", "حدودِ", "برابرِ",
                  "طبقِ", "مانندِ", "ضدِّ", "هنگامِ", "برایِ", "مثلِ", "بارة", "اثرِ", "تولِ", "علّتِ", "سمتِ",
                  "عنوانِ", "قصدِ", "روب", "جدا", "کی", "که", "چیست", "هست", "کجا", "کجاست", "کَی", "چطور", "کدام",
                  "آیا", "مگر", "چندین", "یک", "چیزی", "دیگر", "کسی", "بعری", "هیچ", "چیز", "جا", "کس", "هرگز", "یا",
                  "تنها", "بلکه", "خیاه", "بله", "بلی", "آره", "آری", "مرسی", "البتّه", "لطفاً", "ّه", "انکه", "وقتیکه",
                  "همین", "پیش", "مدّتی", "هنگامی", "مان", "تان"
    , '', 'همان', 'همین', 'آن', 'این', 'های', 'کردم', 'میکنم', 'رو', 'هستم', 'به', 'برای', 'ولی', 'یا', 'در', 'اما',
                  'با', 'که', 'تا', 'از', 'است', 'و', 'هست', 'بود', 'شده', 'بعد', 'می', 'هم', 'هر', 'حتی', 'داره', 'من',
                  'تو', 'او', 'ما', 'شما', 'ها', 'آنها'
    , "!", "#", "(", ")", "*", ",", "-", ".", "/", ":", "[", "]", "«", "»", "،", "؛", "؟", "", 'همان', 'همین', 'آن',
                  'این', 'های', 'کردم', 'میکنم', 'رو', 'هستم', 'به', 'برای', 'ولی', 'یا', 'در', 'اما', 'با', 'که', 'تا',
                  'از', 'است', 'و', 'هست', 'بود', 'شده', 'بعد', 'می', 'هم', 'هر', 'حتی', 'داره', 'من', 'تو', 'او', 'ما',
                  "آباد", "آخ", "آخر", "آخرها", "آخه", "آدمهاست", "آرام", "آرام آرام", "آره", "آری", "آزادانه", "آسان",
                  "آسیب پذیرند", "آشنایند", "آشکارا", "آقا", "آقای", "آقایان", "آمد", "آمدن", "آمده", "آمرانه", "آن",
                  "آن گاه", "آنان", "آنانی", "آنجا", "آنرا", "آنطور", "آنقدر", "آنها", "آنهاست", "آنچنان", "آنچنان که",
                  "آنچه", "آنکه", "آنگاه", "آن‌ها", "آهان", "آهای", "آور", "آورد", "آوردن", "آورده", "آوه", "آی", "آیا",
                  "آید", "آیند", "ا", "اتفاقا", "اثرِ", "اجراست", "احتراما", "احتمالا", "احیاناً", "اخیر", "اخیراً",
                  "اری", "از", "از آن پس", "از جمله", "ازاین رو", "ازجمله", "ازش", "اساسا", "اساساً", "است", "استفاد",
                  "استفاده", "اسلامی اند", "اش", "اشتباها", "اشکارا", "اصلا", "اصلاً", "اصولا", "اصولاً", "اعلام",
                  "اغلب", "افزود", "افسوس", "اقل", "اقلیت", "الا", "الان", "البته", "البتّه", "الهی", "الی", "ام",
                  "اما", "امروز", "امروزه", "امسال", "امشب", "امور", "امیدوارم", "امیدوارند", "امیدواریم", "ان",
                  "ان شاأالله", "انتها", "انجام", "اند", "اندکی", "انشاالله", "انصافا", "انطور", "انقدر", "انها",
                  "انچنان", "انکه", "انگار", "او", "اوست", "اول", "اولا", "اولاً", "اولین", "اون", "اکثر", "اکثرا",
                  "اکثراً", "اکثریت", "اکنون", "اگر", "اگر چه", "اگرچه", "اگه", "ای", "ایا", "اید", "ایشان", "ایم",
                  "این", "این جوری", "این قدر", "این گونه", "اینان", "اینجا", "اینجاست", "ایند", "اینطور", "اینقدر",
                  "اینها", "اینهاست", "اینو", "اینچنین", "اینک", "اینکه", "اینگونه", "ب", "با", "بااین حال",
                  "بااین وجود", "باد", "بار", "بارة", "باره", "بارها", "باز", "باز هم", "بازهم", "بازی کنان",
                  "بازیگوشانه", "باش", "باشد", "باشم", "باشند", "باشی", "باشید", "باشیم", "بالا", "بالاخره", "بالاخص",
                  "بالاست", "بالای", "بالایِ", "بالطبع", "بالعکس", "باوجودی که", "باورند", "باید", "بتدریج", "بتوان",
                  "بتواند", "بتوانی", "بتوانیم", "بجز", "بخش", "بخشه", "بخشی", "بخصوص", "بخواه", "بخواهد", "بخواهم",
                  "بخواهند", "بخواهی", "بخواهید", "بخواهیم", "بخوبی", "بد", "بدان", "بدانجا", "بدانها", "بدهید", "بدون",
                  "بدین", "بدین ترتیب", "بدینجا", "بر", "برآنند", "برا", "برابر", "برابرِ", "براحتی", "براساس",
                  "براستی", "برای", "برایت", "برایش", "برایشان", "برایم", "برایمان", "برایِ", "برخوردار", "برخوردارند",
                  "برخی", "برداری", "برعکس", "برنامه سازهاست", "بروز", "بروشنی", "بزرگ", "بزودی", "بس", "بسا", "بسادگی",
                  "بسختی", "بسوی", "بسی", "بسیار", "بسیاری", "بشدت", "بطور", "بطوری که", "بعد", "بعد از این که", "بعدا",
                  "بعدازظهر", "بعداً", "بعدها", "بعری", "بعضا", "بعضی", "بعضی شان", "بعضیهایشان", "بعضی‌ها", "بعلاوه",
                  "بعید", "بفهمی نفهمی", "بلافاصله", "بله", "بلکه", "بلی", "بماند", "بنابراین", "بندی", "به",
                  "به آسانی", "به تازگی", "به تدریج", "به تمامی", "به جای", "به جز", "به خوبی", "به درشتی", "به دلخواه",
                  "به راستی", "به رغم", "به روشنی", "به زودی", "به سادگی", "به سرعت", "به شان", "به شدت", "به طور کلی",
                  "به طوری که", "به علاوه", "به قدری", "به مراتب", "به ناچار", "به هرحال", "به هیچ وجه", "به وضوح",
                  "به ویژه", "به کرات", "به گرمی", "بهت", "بهتر", "بهترین", "بهش", "بود", "بودم", "بودن", "بودند",
                  "بوده", "بودی", "بودید", "بودیم", "بویژه", "بپا", "بکار", "بکن", "بکند", "بکنم", "بکنند", "بکنی",
                  "بکنید", "بکنیم", "بگذاریم", "بگو", "بگوید", "بگویم", "بگویند", "بگویی", "بگویید", "بگوییم", "بگیر",
                  "بگیرد", "بگیرم", "بگیرند", "بگیری", "بگیرید", "بگیریم", "بی", "بی آنکه", "بی اطلاعند", "بی تردید",
                  "بی تفاوتند", "بی نیازمندانه", "بی هدف", "بیا", "بیاب", "بیابد", "بیابم", "بیابند", "بیابی", "بیابید",
                  "بیابیم", "بیاور", "بیاورد", "بیاورم", "بیاورند", "بیاوری", "بیاورید", "بیاوریم", "بیاید", "بیایم",
                  "بیایند", "بیایی", "بیایید", "بیاییم", "بیرون", "بیرونِ", "بیست", "بیش", "بیشتر", "بیشتری", "بین",
                  "بیگمان", "ت", "تا", "تازه", "تان", "تاکنون", "تحت", "تحریم هاست", "تر", "تر براساس", "تریلیارد",
                  "تریلیون", "ترین", "تصریحاً", "تعدادی", "تعمدا", "تقریبا", "تقریباً", "تلویحا", "تلویحاً", "تمام",
                  "تمام قد", "تماما", "تمامشان", "تمامی", "تند تند", "تنها", "تو", "توؤماً", "توان", "تواند", "توانست",
                  "توانستم", "توانستن", "توانستند", "توانسته", "توانستی", "توانستیم", "توانم", "توانند", "توانی",
                  "توانید", "توانیم", "توسط", "تولِ", "توی", "تویِ", "تک تک", "ث", "ثالثاً", "ثانیا", "ثانیاً", "ج",
                  "جا", "جای", "جایی", "جدا", "جداً", "جداگانه", "جدید", "جدیدا", "جرمزاست", "جریان", "جز", "جلو",
                  "جلوگیری", "جلوی", "جلویِ", "جمع اند", "جمعا", "جمعی", "جنابعالی", "جناح", "جنس اند", "جهت", "جور",
                  "ح", "حاشیه‌ای", "حاضر", "حاضرم", "حال", "حالا", "حاکیست", "حتما", "حتماً", "حتی", "حداقل", "حداکثر",
                  "حدود", "حدودا", "حدودِ", "حسابگرانه", "حضرتعالی", "حق", "حقیرانه", "حقیقتا", "حول", "حکماً", "خ",
                  "خارجِ", "خالصانه", "خب", "خداحافظ", "خداست", "خدمات", "خسته‌ای", "خصوصا", "خصوصاً", "خلاصه", "خواست",
                  "خواستم", "خواستن", "خواستند", "خواسته", "خواستی", "خواستید", "خواستیم", "خواه", "خواهد", "خواهم",
                  "خواهند", "خواهی", "خواهید", "خواهیم", "خوب", "خود", "خود به خود", "خودبه خودی", "خودت", "خودتان",
                  "خودتو", "خودش", "خودشان", "خودم", "خودمان", "خودمو", "خوش", "خوشبختانه", "خویش", "خویشتن", "خویشتنم",
                  "خیاه", "خیر", "خیره", "خیلی", "د", "دا", "داام", "دااما", "داخل", "داد", "دادم", "دادن", "دادند",
                  "داده", "دادی", "دادید", "دادیم", "دار", "داراست", "دارد", "دارم", "دارند", "داری", "دارید", "داریم",
                  "داشت", "داشتم", "داشتن", "داشتند", "داشته", "داشتی", "داشتید", "داشتیم", "دامم", "دانست", "دانند",
                  "دایم", "دایما", "و", "شد", "در", "درباره", "در باره", "در ثانی", "در مجموع", "در نهایت", "در واقع",
                  "در کل", "در کنار", "دراین میان", "درباره", "درحالی که"]

# Max number of words in each complaint.
MAX_SEQUENCE_LENGTH = 250


def normalizer(raw_texts):
    normalizer = Normalizer()
    refined_texts = [normalizer.normalize(re.sub(r"[^\u0600-\u06FF\s]|،+", ' ', x)) for x in raw_texts]
    return refined_texts


def stemming_and_lemmatization(raw_texts):
    stemmer = Stemmer()
    lemmatizer = Lemmatizer()
    refined_text = list()
    for txt in raw_texts:
        tokens = txt.split(" ")
        arr = [lemmatizer.lemmatize(stemmer.stem(i)) for i in tokens if i not in stopping_words]
        seperator = " "
        refined_text.append(seperator.join(arr))
    return refined_text


def tokenize_and_add_padding(texts):
    tokenizer = Tokenizer()
    tokenizer.fit_on_texts(texts)
    X = tokenizer.texts_to_sequences(texts)
    X = pad_sequences(X, maxlen=texts, padding='post')
    print('Shape of data tensor:', X.shape)
    return X


def one_hot_encoder(raw_lables):
    encoder = LabelEncoder()
    refined_lables = encoder.fit_transform(Y)
    new_Y = pd.get_dummies(lables).values
    print(new_Y.shape)
    return refined_lables
